---
kind: method
id: M:Autodesk.Revit.DB.Parameter.SetValueString(System.String)
zh: 参数、共享参数
source: html/4218a8dc-1102-1766-8491-66e461e77ee5.htm
---
# Autodesk.Revit.DB.Parameter.SetValueString Method

**中文**: 参数、共享参数

Set the parameter value according to the input string.

## Syntax (C#)
```csharp
public bool SetValueString(
	string valueString
)
```

## Parameters
- **valueString** (`System.String`) - The string that represents the parameter value.

## Returns
Indicates whether the parameter value is successfully set.

## Remarks
The method only applies to parameters of value types.